Revit 2024 API
TransferredProjectStandardsEventArgs Properties
The TransferredProjectStandardsEventArgs type exposes the following members.
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
SourceDocument
 Source document.
TargetDocument
 Target document.
See Also
TransferredProjectStandardsEventArgs Class
Autodesk.Revit.UI.Events Namespace